[
  {
    "version": "v0.2.8",
    "date": "9/28/2016",
    "trailer": "qr8AJyuS-VY",
    "characters": {
      "new": 1,
      "total": 19
    },
    "updates": {
      "major_updates": {
        "list_of_major_updates": [
          "Added NEW BG: Time Chamber / ROSAT",
          "Removed BG: Trunks Arrival",
          "Krillin Major Overhaul, Details: https://www.youtube.com/watch?v=SQLIcWp_s2w",
          "Modified EXE art"
        ]
      },
      "minor_updates": {
        "sprite_changes": [
          "Electric sparks are a new colour",
          "The bottom of Goku’s shoes are now red like how they should be"
        ],
        "new_moves": [
          "Vegeta (Android): Big Bang Attack",
          "SS Vegeta (Android): Final Flash",
          "Super Vegeta (Android): Final Flash",
          "SS3 Goku (Buu): Dragonthrow",
          "Ultimate Gohan: Dragonthrow",
          "Ultimate Gohan: Burst Rush",
          "Ultimate Gohan: Ultimate Kamehameha",
          "TEAM ATTACK: Final Kamehameha (SS Goku and SS Vegeta)"
        ],
        "speed_enhancements": [
          "SS Vegeta (Android)’s Final Flash: 13 TU",
          "Super Vegeta (Android)’s Final Flash: 13 TU",
          "SS Vegeta (Buu)’s Final Burst Cannon: 6 TU"
        ],
        "list_of_minor_updates": {

        }
      }
    }
  },  
  {
    "version": "v0.2.3",
    "date": "5/28/2015",
    "trailer": "SG7xyZ4B33w",
    "characters": {
      "new": 4,
      "total": 18
    },
    "major_updates": [
      "New Face pics: now using anime pictures and shows level, attack and defense indicator",
      "Re-added ads to EXE but they are all related to the DBZ LF2 links and less visually obtrusive",
      "Modified EXE art"
    ],
    "minor_updates": [
      "Common melee attacks now use state 7 in the itr frames. So basically while you are attacking you are also defending to create a small type of “clash”",
      "Jump recovery (flips) now DRAIN ki",
      "AI improvements to all characters, mostly on CRAZY! Mode only though",
      "Goku and Vegeta can now fuse into Vegito using potara earrings, 50% chance Goku takes control and 50% Vegeta takes control, +500 health"
    ]
  },
  {
    "version": "v0.1.7.1",
    "date": "8/28/2014",
    "trailer": "kTELdzzAm0w",
    "characters": {
      "new": 5,
      "total": 14
    },
    "updates": {
      "major_updates": {
        "list_of_major_updates": [

        ]
      },
      "minor_updates": {
        "list_of_minor_updates": [
          "Changed Hunter’s arrow to a level 1 ki blast",
          "Changed Ice (frozen) effect to blind effect (still in beta as you become temporarily invincible)",
          "Instant Transmission now teleports you to opposite side of where it usually puts you. (So if you and your opponent are facing each other, instead of continuing to face them, you will teleport behind them)",
          "Created a shitty recolour of the Cliff background to try and make my own wastelands hah",
          "Decreased the size of Super Vegito’s Kamehameha ball by 25%",
          "Added sound effect when you deflect a ki blast",
          "SS Vegeta (Android), Super Vegeta(Android) and SS2 Vegeta (Buu) use Big Bang Attack a bit faster with new voice clip!",
          "minor speed increase on Majin Vegeta’s Final Impact and it no longer disappears after a second (unless of course it’s destroyed)",
          "Fixed all of Vegeta’s bpoints (blood)"
        ]
      }
    }
  },
  {
    "version": "v0.1.3",
    "date": "7/25/2014",
    "characters": {
      "new": 4,
      "total": 9
    },
    "updates": {
      "major_updates": {
        "list_of_major_updates": [
          "Compressed some of the BMP files making the extracted game much smaller (side effect includes some loss of quality in SOME of the sprites, but is hardly noticeable at all, especially in the heat of battle)",
          "Modified EXE art",
          "Modified SS Vegeta (Buu)’s Hellzone Grenade (originally shot 6 ground balls, now shoots 7 ground and 3 sky)",
          "Re-applied combos to the Vegeta (Buu) characters"
        ]
      },
      "minor_updates": {
        "list_of_minor_updates": [
          "Fixed Vegito and Super Vegito’s Explosive wave hitboxes and adjusted damage.",
          "Added random “spectactor” in so you can watch the AI battle it out in VS mode",
          "Re-added Bandit and Hunter so there is like a “stage” mode kind of (except their health is same so really easy to kill with higher level chars)",
          "Added my old Krillin character for some more variety. Haven’t edited the character but added some AI and 1.2 armor defense"
        ]
      }
    }
  },
  {
    "version": "v0.1",
    "date": "7/4/2014",
    "characters": {
      "new": 5,
      "total": 5
    },
    "updates": {
      "major_updates": {
        "list_of_major_updates": [

        ]
      },
      "minor_updates": {
        "list_of_minor_updates": [
          
        ]
      }
    }
  }
]